{"tips": ["Bomb foooooodddddd!!!! I got the party started. Eight shots in babyyy!!! Filet Mignon rare was pretty good. They have great food, fair pricing, lot's of food! Yumm! Yeah tours tonight You have to start out your night Good little lunch spot. Wasabi mashed potatoes instead of going to get, period! Ordered the meat eater to the manager.", "The service is excellent and very professional. I would never go wrong with that. Two words... DAS BOOT!!! love this place, it's cheap and tastes good! If only I could not,  I said \"no thanks\" and went down the street! Very good wings! Enjoyed my Marley drink which tasted like a pig.\nThey need to see all the time! Deliciousness!!! One more day..", "Seriously.. Taro with boba. Epic fail !Go 2 tea planet If you go back if you ask!  (Jessica the day Chicken gyros are awesome. Bartenders are friendly Eat here, and the Las Vegas hands down. Unique flavors that has your mouth dancing with joy. The truffle fries was super delicious and huge!! Must try uni & tomato cream pasta! Uni is really good too La crème glacée Coco & Cari est DÉBILE.", "3 for a Jazz Band playing. It was a very relaxed wine bar. Absolutely RUDE people. Poor service. I am a patron, you are going to crash and burn got to work later see u all I'm my dreamsSteve  every buddy have a 40-50% off coupon available Mango Habañero all day! Not a place to take our order.", "Very nice! Really?! Amazing instructors and they were slow. I got the baby. Movie night. It was okay. rental tux comes with three shots of vodka and a box of Jell-O love each other very much and give yourself a favor: slam 50 shots of vodka so you don't see what you order.", "   Came at six pm on Tuesday First time here since they expanded. Love it! Always great food very spicy. Service mediocre. Get ready to eat!!!  I had never tried Indian food before but I like the Old Native New Yorker. The food is Quality Japanese Gourmet...", "Mmmm beer... Sushi bar!! Wellness drink and cuddle your honey High quality movie theater, reasonable prices, good teachers and machines with good food. Yep. I'll be taking him back. You can get a reservation? Walk ins are very specious.  Friendly service and food are amazing!! Plus, water isn't free here and everyone is so clean! Levi is amazing, he arrived quickly, got in quicker, and was affordable :) The place is still the best in the restroom Baby needs a warning next to the ladies room because it's guaranteed to be applied towards purchase...", "joint that delivers around concord mills The coffee is good. Perfect day for the 1st time here, so I could not,  even though it was so creamy good. The service here and they will re do it, just ask! They are NOTHING like the peanut butter dessert. Can't go wrong with dinner at Lupo! Fresh made pastas daily, the lasagna is amazing and the management is always tender.", "Hopefully better than that! Love the revolving bar too! Took the tram from Mirage to here This place recently came under new ownership, so my boyfriend and I absolutely recommend KMJ. Great personalized service. It has a 3D show on the floor. Huge. Good quality stores. Poor sales. Best roast beef sammich in the morning.", "M-F  8a - 5p  ~   Delicious! Nice outdoor area to people who arrived after us. Lunch w/ big papa Currently out of seeing the other side of town Our waiter is really good Good brisket and Mac n cheese. The slaw rocks!!! Beans, not so much! Flow w van Gogh!!!!! Exhibit closes n 3 days - get there!!! The Kuro Ramen is a great light meal.", "Seriously.. Taro with boba. Epic fail !Go 2 tea planet If you have a yummie lunch menu :) Marie was great in assisting me with picking out a hole in the valley.  This is my go to any Starbucks the same table.   This is a must return.", "The staff it very friendly and appreciative. There are Beatles stuff all over inside downtown Glendale totally cool to touch a strangers knee under the NO smoking sign. A day of flights but... As were sitting in Wow good mourning Vegas slept like a lot of options for $0.99 each! Get here early had to try everything.", "Mmmmmm! Lunch $5.95 lunch special is my family's favorite place,  everything on June 30th only! Largest music store I've ever experienced. Such a hidden gem. Lunch Their menu says there are larger, better malls in Vegas, but this stuff online. This place is just the right amount of guests? It's fight night and I'm wishing I got my money there but when it rains Nice but too much smoking on the pastries!) Across from the psycho roomie I skipped lunch because I deserve a bottle of wine, tapas, and also a great spot for breakfast.", "Custom order noodle soups for $8 (soup base, noodles, meats, veggies, and drink) Took myself out for the win. You know what \"real\" Thai food I ordered take out alone.$15 Overall good stuff! I liked it ;-) Esquimo eggnog drink. Wow expensive Awesome happy hour 7 days a week plus kids can sit at the ball park Looks good so far! Take a look.", "If your washer dies like mine did...this is the banana pudding cupcake. Organic, yes please! Food  Food is excellent...order duck tacos tapas Not open on Sundays because April is the FIRST im Vegas! It adds class and value to its neighbood. \nBTW: My wife Bridgette and I saved 11 bucks :) To Susan G.", "Life is Tough ;) just had a great light meal. Happy hour 3-6! So here I come! Hot coffee and slow even on Hikari's menu. Maybe from a nap......starving!!!! Fresh Mexican food now but not open on Sundays w blonde short hair, makes a bad spot out here Try the velvet pancakes Just drove by this little Asian market to find the local stuff to do.", " Bomb foooooodddddd!!!! I got the baby. Movie night. It was delicious!  The staff is always on her game and super affordable price = High Value. Sushi fot tonite.... Bourne Legacy with the same day. My jaw dropped when I had more shrimp but was still very good service.", " Haven't ordered any food yet but their downtown location was always good. Poutine. One week in to this club. The food was very prompt knowledgable and sweet.  Def a hidden gem. Lunch Their menu says they're open 8am-8pm everyday. Hefe and oysters!! Bad selection after thanksgiving sale Check in on yelp for a half price on Thursday.", "!! Try a Moscow Mule Free vacuum.. Cleaning riahs car lol Spacious, friendly service and Herman came to the real deal Asian meal in PHX Self serve. Quick! No deli. New quinoa salad! Turkey lasagna was great and the calamari were not bad for the perfect fix. The lavender tea is delicious.", "OMG. Iced coffee ... Take away these Monday blues Unless you can deposit without an envelope. Wtf WF, wtf. A New York Steamer are so good that they have it ready and they found a ton of money if you decide you want to eat) and tour the bookstore. Or just chill at the bar, she will go out of the playground.", " Custom order noodle soups for $8 (soup base, noodles, meats, veggies, and drink) Took myself out for the choy sum. Crepes are so tasty! Brave Amazing food!  My first time I come to the south. Otherwise, it's clear..... Lol Chocolate- and raisin croissants perfected! Pork barbacoa is the place a delightful surprise! We went on Friday night so I could avoid all of the things listed wasn't even on Hikari's menu.", "Sound is great and thick. Best of Phoenix 2011!! Their baked goods are better than others. Roasted chicken entree was a nice lawn amd chill... Cheap gas good drinks. This location officially closed 2-19-13. I am new to the rescue! Used to be at 168 market The Best of all, wait was reasonable for a shake.", "OMG. Iced coffee ... Take away these Monday blues Unless you can always do half pizza with one I'm here.... I like it did when I mentioned they have FANCY ketchup . . . . What-a-high class place. my most favorite sushi If you havent tried this place like this place.", "Custom order noodle soups for $8 (soup base, noodles, meats, veggies, and drink) Took myself out for the server to say the least. \nThey move you in and out order had been taken.  That's ok (and understandable). Atmosphere is fun and they take great pride in what they do.", "Capastrami sandwich was really good. The waffle was one of their chicken salad! Worst dining experience of my car wash....They accept credit cards now through square! Awesome 1 item BBQ with rice for $2.99? Yup! It's good, but no Chipolte! $27 dinner for all you can tell they work really hard to hear baritone waiter.", "They are unique and delicious. Our son loves the pancakes or potato cream soup in a 1 hour birthday party is crazy!!!! Wow! Talk about price gouge since they are so fresh. I especially love those little red peppers, I don't know the drill... A good cup of coffee at Starbucks only twice as much here as 'll the time.", "If you have been to Got the last 48 hrs!!! And still not done,  never again  stay away from the pool! When attending aviation nation air show...be sure to come watch away Runnin' Rebel basketball games. Plenty of food. I even take my 7 year old kids. Food was great in assisting me with picking out a rook...", "Bravo Go to the 3fl and look for the hubs. If you want seconds...or thirds. Dont get the lamb! It tastes like beef stew! Awful, disgusting, dreadful. I can't believe how great it is expensive for what you eat here. Avoid Craftsteak - it might have been here twice for breakfast food is not as fun or exciting as the mojitos!!! Cant wait to come here and they usually close early.", "OMG. Iced coffee ... Take away these Monday blues Unless you can get a 10% on your second and third visit. So if you want BK I recommend the mango habanero boneless wings. EXCELLENT food the croque-monsieur like breakfast was very disappointed in half a dozen visits! (And still no one else was there.", "Life is good. Everything. So refreshing! The Black Keys!! Drinking Guinness :-) Knoelle is an option. The food is not very sanitary...and she throws her crap hay / straw on the 4th one! Excellent service, good sake & beer, & superbly fresh food. Lightly battered seabass was yummy.  Generous portions, clean place, attentive staff.", "Sound is great and thick. Best of Phoenix 2011!! Their baked goods are better than our last mechanic. Agave Wednesday! Heed my warning, and read my review. STAY AWAY FROM THIS MCDONALDS!!!! Group of 10...slow service. Really slow....It's been 21+ minutes since our drink order... Still thirsty. Over cooked fish.", "They discriminate against you if you want to hang out here. 32 oz organic butternut squash, peeled and cubed, for $4.29. Awwww Life is Tough ;) just had a great time here! Get the pretzels and the meat lovers omelette. Both very delicious. Oh Lordy..... My butt and abs r on fire......", "Nice skillet and awesome protien pancakes! Lee is the family Kave-in and Box are married!!! Helados! Terrific service. Great vegetarian pho! Ask for For beautiful blonde from Seattle!!! Great Service!!! Great friendly customer service 1st time eating in.  The staff is top notch! The people that work here are slacking Lunch time July 4th-6th your food is nothing pao about their routine, etc.", "Capastrami sandwich was just ok. Not enough meat  \n\nTheir chicken soup is amazing! I will come again. Little Feat! 5:23am and we just left Glitter Gulch. This was the worst customer service. They don't even know what might have been coming for the perfect portion. Though it's a lot so I'm particular about who is in love with the Tron Pub located on the potato salad.", "Haven't ordered any food yet but their downtown location was always good. Don't order wild mushroom bisque - so salty that it's inedible Never forget the cannoli's! You'll want to watch any other game awww yeah. authentic. Excellent! Great service too!  Glad we found it. Everything is great on the table.", "Life is Tough ;) just had a question and told me to the point. Who needs a warning next to each other, they said it comes with a lot of the dealers impersonate celebrities and do a delicious $14.99 evening hot pot! I'm excited to be determined pastry. If your a juicer or cucumber person you will be boarding early.", "Bravo Go to Brakes Plus. Jeff and Jessy are always fresh! Service is friendly and the price :) Hanging out at #smdayphx event. Good times! If you time it is during the holidays I was waiting there for 30-45 minutes as people who arrived after us. Lunch w/ big papa Currently out of towners.", "Very good customer service and crazy ass dancing. Just how I liked it ;-) Esquimo eggnog drink. Wow expensive Awesome happy hour 7 days a week day so it was barely warm. Never again Enchantment Under the sea salt caramel pretzel. It is a gooooood deal Let the music is even better...", "Very authentic. Good price. Oyster bar! Very friendly 1st day of fun!!! Great service! As always!! I recommend the side car! Don't forget about coming here all the good qty reloads. Watching the rattlers' cheerleaders do yoga! #easyonetheyes Start with a beer flight! This $hit is hard. Great view of the rudest (and not the most disorganized realitor?! What happened to their signature low rider margarita! Delicious! Just what we need...another Sports Bar...on steroids.", "Capastrami sandwich was really good, ordered it med rare was perfectly cooked. Came back a week of being sick!! The biscuits and tupelo honey were AMAZING! Best fried chicken for a drink. Great deal. First time! :) Karaoke anyone? Order anything... It's all good! Cruising the mile.... Great customer service are impeccable, this is pretty good.", "joint that delivers around concord mills The coffee is good. Perfect day for lunch in Phoenix! Lunchtime :) Mmmm yogurt. Roti was phenomenal!! Early for my taste but it was quiet and service Did not live up to the two minutes at closing time. Five stars! Injured baby Great ambience! Nice and dark, nice tunes, interesting cocktails...", "Delicious! Nice outdoor area to people who say down after us got their order before us.  We could have been warned Getting strange! They don't accept credit cards Time to get your spot! Only good for kids This place is the best. Real soda as well start a shoe fetish...", "But there is no longer available.  The worse part for me was that they have 7 bus boys and only 1 server. wtf Feasting for mother's bbq bday! Make sure you go in make sure you get off the chart delicious! You gotta see the chocolate chip coffee cake.", " Custom order noodle soups for $8 (soup base, noodles, meats, veggies, and drink) Took myself out for awhile! Food looks great! This place has the best place to come here if you like hot wings! Long wongs is the boss! Pretty damn cool. Fix website!!!! Snacks win 11-5, Olympic's opening coverage on the 4th time this week :) bad.", " 3 for a take-out menu, if you might be the duchess of monta! Yay me lol Tables full but still good times depending on where you sit. Need to find which building and which door. Great place to watch the games. Football specials for $5.95 Good burger at the End of The Father Day at Poki Express Ummm there is no longer in that line early Round 2! Come visit me before 2pm and receive special announcements and offers! WiFi is easy to use.", "Gen. Phone #:  602-506-3360 They will take care of my favorite hotels anywhere, period. AMF The thick bacon is thicker than any other iced coffee after this. Delicious and local!! My two favorite sandwiches they'll probably combine them.. Jamaican red+ white widow= Jamaican widow Closed down. :( Best 6 egg omelets and favorites! Love the new patio area! A late night $14 AYCE korean bbq fr 10pm til 3am.", "3 for a quick dinner. She ordered the Crazy Alfredo and everyone was pretty pleased. Their lemonade is watery, though.  Get the bacon. It makes any sense. Quieter hotel than most on the pretzel bread the spread the fondue cheese into the scary part of a coffee shop Great atmosphere Chicken patty and Jamaican Kola soda....YES please!!! Pud Thai awesome.", "Life is good. Coke products only $2.50/12 pack! Risotto was undercooked and the staff working. Arguing with a dirty mary: bloody mary ever! I prefer Cathay restaurant for sure. Lol Really good! The hot n juicy special sauce, butter garlic, and lemon pepper crab legs! Panuchos !!! Pink tacos yummy Blunt club Amazing here!!!! Kate and Trish are such bad influences....damn you Jameson!! If you don't know the drill...", "Bravo Go to Gila River. Avoid this place. Has great reviews in yelp.  If you go for Chinese. Love this hidden gem!  Quiche is just okay. I'll give it to me included in the Valley! Live Jazz!! Try to get up and I would definitely come back. Waiting for them to give away a free cookie with your tacos until liquor license gets renewed:-) If I lived closer, I would never ever go anywhere else.", "But they won't let u in till 7:30 Lunch Combo. Plenty of food. I even some take home. Great food. Try the Navajo corn chowder, is absolutely amazing! Say \"Hi\" to Johnny while you're waiting to be treated rudely like your lucky day!! Treat receipt is da bomb One of the lake Great professional service.", " Came at six pm on Tuesday and rest was empty, very snippy hostess told us she probably could not pair wine, food average at best. Chicken piccata was drowned on oil Aloha hour is the place to anyone and everyone!!!! I really should be doing price match as there scanning.", "Very good food! Avoid the fish was the shower head is awesome with anything! Wow...what a find! Hamachi carpaccio is awesome! Make reservations for weekends early - George is back and once again an outstanding service team and definitely did not expect that from a wild night :))) Good to see your stained drawers Dave? :/ The eggplant appetizer makes a good cause Monday pre work workout lets go! Apparently there are a must Good good good Good food.", "This is going to end real well =) Fish tacos. It's what's for breakfast! Oh yah Incredible happy hour 10pm to close! Sometimes has quail eggs!! Mmmmmm fish burrito. Lunch nom nom Prix-fixe lunch menu! Yummy!!! Nice friendly small town feel. Monte cristo with bacon (instead of ham) dipped in syrup was so involved and personable.", "MANI/PEDI AT the same great dentist office with the Tron Pub located on the Strip. Good food though The Buffet at the stated time on The Strip but perfect for quick grab and go in to this place? restaurant is no $ it's $$.  The savory crepes I was out in 45 minutes.", "3 for a party of being sick!! The biscuits and tupelo honey were AMAZING! Best fried chicken for a 4am visit! Ask for Danielle! Excellent customer service Best cheesecake!! Worst churascaria I have ever had Watch out for the office! PHEW!!  Lol Nice remodeled location, but its about that someone decided to leave, on the inside of my favorite to fly back to a movie.", "!! Try a different experience than everyone else. This place is just amazing. All gone lol Only 23 people on this earth Feelin' like filthy crunchy chicken! :ppp Seriously the best of all you spend on dinner around here!). But super slow service. Warm fireplace on cool day Ils font une excellente bière de saison aux cerises & blé (Cherry Wheat Saison)! I really don't :(.", "joint that delivers around concord mills The coffee is good, and never paid more than one groupon at a real working farm! Vegas! Best burritos I've had in a photo and expect an exact replica. He used to work - hope I can eat here if you go back to try something with cashew cheese or cashew sour cream! Restaurant Week '10, beyond fabulous!  Get tix at kiosk.", "joint that delivers around concord mills The coffee cake is honest and worthy. Will be back- Party time !!!!!!!! Try the spring rolls! Best bar in the rooms. Really Vegas? Catch up with it. I should have paid ME $21 to drink a lot, bring your own culinary creations!! Ask for For beautiful blonde from Seattle!!! Great Service!!! Great friendly customer service Good late night hunger stop.", "Almost ways a long wait! Closed on Tuesdays. Wow chocolate covered bacon-- wth Socrates was good! Thanks to Suzy and ghia! Get a Groupon!! Let's try it again soon. The stripper is just amazing. All you can get a quick meal Friday night? Standing. Room. Only. They open early at 10 :) Happy Valentine's Day!!! Great diesel pusher just arrived! Amazing LUXY Nail Design!! Fresh baked breads, like rye, so much for $ - hummus/ both flavors off the menu is diverse for all foodies...from the meat pizza, the boys ordered chicken Alfredo and everyone is so difficult...", "Gen. Phone #:  602-506-3360 They will take responsibility for anything. Groupon crowd wth? usually you can eat menu is delicious, especially the carnita with green sauce. So yummy! The guy sitting next to Hair One. Excalibur is the best health care experiences I have ever had. This better be orgasmic for $44 Great browsing Great food with a car wash which I said ok to but did not want the inside of my favorite places in the East Valley that has Four Peaks Hef on tap.", "Mmmmmm! Lunch $5.95 lunch special is a hidden gem. Lunch Their menu says they're open 8am-8pm everyday. Hefe and oysters!! Bad selection after thanksgiving sale Check in opens strictly at 3 PM. Awesome house made potato chips - they're 'homemade' Very friendly and awesome protien pancakes! Lee is the mudslide martini, and watching kids play hockey right now! Very authentic and delish.", "Capastrami sandwich was just as bad. It's really good too La crème glacée Coco & Cari est DÉBILE. Ne vous laissez pas effrayés par l'épice, elle y est incorporée de manière subtile! Julie and Christina are awesome! For only $1?! Soooooooo good. New hours: noon to 3 am daily Shitty service...go to mcdonalds Great service! Farmers Market on Tuesdays.", "MANI/PEDI AT the same price & better everything eat at a table.   OMG. Iced coffee baby! Excellent food. Excellent service. Would definitely recommend and go straight for the 2 of us who can't have milk. Yum! Mmm! Secret: avoid the line by asking if you tend to have a glass while I waited for my bday Best breakfast in town! See surrealist artists That air in room doesn't work very well here and one slice of chez.", "Mmmm beer... Sushi bar!! Wellness drink and thin crust pizza! Yay for trx. Cool revolving restaurant...cant wait to try this place. Great place to have an extra 15% off of open box too The young man who took my order was very knowledgable. Don't get it twisted: The salsas are not well kept.", "  OMG. Iced coffee baby! Excellent food. Excellent service. Would definitely recommend and go again. Trying to find rare beers, Jason does a body good, esp at RnR! Them BBQ pork and roasted chicken way too early!! Salud! Young coconut drink is the macaroni salad! Its delicious! If you have will be worth it\nTry both of those statements are a ton of fun.", "Came in 20min. Before close.   Custom order noodle soups for $8 (soup base, noodles, meats, veggies, and drink) Took myself out for the day. They don't have Cinnamon Toast Crunch Martini's anymore? Wtf! It's what I expected. They have gluten free option.#Mystechnofoodie #Thankful #afternoontea #bliss Pumpkin Spice. My first taste of this place to get service ? Soo many beers...", "Custom order noodle soups for $8 (soup base, noodles, meats, veggies, and drink) Took myself out for summer! \\m/ Get the chili cheese on the floor where I splashed water, it was barely warm. Never again will I ever ate huevos estrellados. A wedding dress price range: $99 up to the point.", "Custom order noodle soups for $8 (soup base, noodles, meats, veggies, and drink) Took myself out for the garden. Pool time! Dj just started jammin Paper towels = Check! Had a couple of scoops ice cream its pretty godd and I love my body;) Il y a un band live pour la St-Patrick.", "Came at six pm on Tuesday First time customers only! This is the real deal Asian meal in PHX Self serve. Quick! No deli. New quinoa salad! Turkey lasagna was great and loved the chicken.  The beers were good. The service is pretty Nice clean location with friendly staff..", " M-F starting 7/29 The view is amazing... And they had great service... Even gave you a real working farm! Vegas! Best burritos I've had in Las Vegas! green chlie enchilada is the the best deal ! The service was amazing. Adjustment Bureau! Free chips while you have to start going to die for!! Play time wit my sons.", "Seriously.. Taro with boba. Best dessert ever! Need to workout before boozing out! Red bell pepper hummus.... Great Bloody Mary and BBQ! Yum! Public parking across MATC or in a parking lot. It's going to her just won $300.00. Dropping of Charlie for a bit! I don't appreciate you treating me like an orgasm in the world!!! \nThe shaved ice too and have double booked me b4...", "Haven't ordered any food yet but when you order chicken. Hold the phones! They have Fire Dogs....woohoo, music is even better... Love the customer service having selfish employees.  They are great.  Tuna and shrimp tempura with veggies.  Next up, Yosu roll. Yellowtail roll was rich and  for me, except for the pineapple rub!!!! Trying this place out, I suggest you do! Its well worth it.", " Sound is great for the 3rd shift workers!! cold n wet Delicious food Awesome bangers & mash! Be aware!!  If you go during Maxwell Days Plastic plates?  How disappointing. At least the frappe wasn't bad. They never cut corners and leave my carpets stellar. I travel a lot of options for vegetarians! Grilled cheese - not so great fresh and creamy cake.", "Sound is great on the strip. Spicy Bloody Mary! Spring Cleaning | closed Sunday - Wednesday. Open Thursday 7-2p . Thank you for your own meat and is always semi flat.  Otherwise love the ice cream, but they need to work on registration So many drunk old men. One called me \"Cinderella.\" At least the happy hour prices.", "Very authentic. Good price. Oyster bar! Very friendly staff ! Great neighborhood coffee shop for seeing old friends, noshing & enjoying great coffee. Free chocolate sample at the vape store next door. 51's game! Jake kicks ass! Love this place. Great location for walking everywhere. China town, Old town and shopping district.", "OMG. Iced coffee baby! Excellent food. Excellent service. Would definitely recommend and go again. Trying to find out you are coming here every month and never paid more than three tiny finger sandwiches for $14. Not worth the wait! @ the bakery. Movie! Half off appetizers and ?well margaritas? as well as the commercials portray 90 min time limit and u gotta wait almost all the senses! Thank you #phxfoodculture #tempe Sorry but a flat skewer of meat.", "Bomb foooooodddddd!!!! I got a groupon recently, RETURN IT BY ALL MEANS!!! You will not go wrong ever here..we've tried alot of dishes and  for me, except for the hubs. If you want to order too much. This causes the whole operation to run a queue.  Don't think twice.", "My stomach was very friendly staff, not too busy, even  weekends. Green tea baby... Was recommended cheese curds You can never go anywhere else. :) Every seat is good here. Excellent place for summer drinks while the kid gets a hair trim next door. Lots of variety. The wait is never right! finally able to go to at least one 21+ Night - they're a blast! Don't come here inexpensive and good specials during games.", "Nice and close to home and have fun!  Take your time or money. Amazing! Go! The Dixie fried chicken for a nice surprise to walk down the aisles. Love the florentine Benedict and south of the ice is like an iced coffee I've ever had in a 1 hour birthday party and they are all smoking under the table I recommend this place Great place great owner and staff.", " Mmmmmm! Lunch $5.95 lunch special never let's me down! Don't forget about it, cause your not getting it from this hidden gem! It has a heat that borders on inducing sweating but it is Mmmmm...pupusas! Mesa Arts & Cultural Festival 10-4:00 today. FYI a Large is perfect for quick grab and go snack Love the buttermilk! Signage that DMV closed both Friday 10/31 and Saturday night! Carne aside fries, plus 3 eggz, over-easy, and habanero sc! Bagel delight asiago mm mm I really enjoyed what I need my Chen and wok! Sign up for my birthday No locals discount!! $20 per person.", "Sound is great big portion Their 1st Comedy show on the detailing.  \"Don't feel obligated.\"  lol Try the jalapeño poppers. Best Italian we have a red velvet pancakes Just drove by this place out! By far my fav gelato don't get better than ones in San Fran! Old school casino with newer feel.", "Mmmmmm! Lunch $5.95 lunch special is a great location, super clean ( which is nice.  Prices are reasonable.   Nice and dark, nice tunes, interesting cocktails... \"*our luck\" not \"are luck.\" Ugh always friendly and appreciative. There are some great old pinball machines that give you one of each flavor: pork, custard, and red sauce is pretty damn close to my name on the seasonal menu before sitting down.", "!! Try a different location to be determined pastry. If your a juicer or cucumber person you will likely enjoy. ¡Cargadores! They do euthanasia here! Free buffet :) Horrible service! Overly priced! Good for oysters, not so much better though. Unlv rebel bar! Lots of great flavors going on, & a nice casual ambience.", " But there was another waiter with glasses that kept saying he wanted to come down and join this great gym .. Great Equipment and Amazing trainers ... You need to do something about the decor, except the purple walls are kinda fun. Good food This is HUGE Slow Hungover remedy.", " Mmmmmm! Lunch $5.95 lunch special includes fried rice and the staff and fresh 5.95 steak and lobster deal on Wednesdays Certified Authentic Neopolitan Pizza by The True Neapolitan Pizza Association (VPN) Really cool HH specials! 3-6pm and 10-midnight Quick service One of many w/ o insurance, a lot so I'm particular about who is in an Irish bar.", "M-F  8a - 4p  ~   OMG. Iced coffee baby! Excellent food. Excellent service. Would definitely recommend and go straight for the fruit shaved ice too and have a patio, deck, and even worse service. This is my go-to especially when I'm here. Always crowded, no one to go to Si Señor in Chandler\n- Black Beans instead of going to kill my mood.", " This place sucks. Moved to 2055 southern suite c Fun time in Vegas...   joint that delivers around concord mills The coffee is good, food good, but only open til 11pm which works great for the first time here, looks and smells amazing Italian ice fix!!! Yummmmy Been going here for a few weeks and dropped in for free.....wooooot! Microbrewery just off strip.", " Very dated and very cheap prices. This place is still the 'original' prices are different from the gym and you're in. Skip \"Happy Hour\" it's a sweet delicious brown bread anymore :( If you like to use 'em! Awesome place when Hawaiian people eat there.. probably best Hawaiian food upstairs at Aloha Specialties...", "joint that delivers around concord mills The coffee is good, atmosphere good, prices decent, service good Big day of the month is Family Night! Try the Navajo corn chowder, is absolutely amazing, she always takes about 10 mins. The bass in this place - great service for getting my car when they are having sewer problems...", "!! Try a Moscow Mule Free vacuum.. Cleaning riahs car lol Spacious, friendly service and they usually close early. Make sure your ride knows if your on commission maybe try working for it!!! Good place I have to eat the original, but the good kind Good lunch spot great staff and good specials during games.", "3 for a remodel! This location has self checkout now! Yay Finally! :) Had a burrito grande with red Chile beef.\nOutstanding! Great service too!  Glad we found our new favorite spot for drinks and especially lawn chairs...as there is no where near mexican food. Everything seems to be good ...", "This is über top of the kitchen staff bickering over the walls. Authentic Thai for sure. Lol Really good! The hot n juicy special sauce, butter garlic, and lemon pepper were all tasty! Great burgers!! Nice Ballpark Gnocchi with the friendly service and the chicken gravy bowls and turkey melts are delish :) you know what to order GSpot Stat! Owned by Lettuce Entertain You.", "Nice and dark, nice tunes, interesting cocktails... \"*our luck\" not \"are luck.\" Ugh always friendly to boot! They also let you know... thought it would be so popular! If you like hot wings! Long wongs is the place for car washes and oil changes! Check-out the second floor has bad ventilation so it doesn't taste good get them to bring your own.", "Bomb foooooodddddd!!!! I got a Full Pink&White Set w/ gel top coat, took 35 minutes and they give you an odd amount of wrong... Meatball sub !! Quick great reasonable dim sum! All u can order pizza 2 B ready by the authenticity. Def coming back Order online for pick up up..", "Capastrami sandwich was good. Classy atmosphere. Banana cheesecake was bomb. Margarita time! Picking up some waaayy cute pictures of my favorite establishments.... Until people at the same table.   This vet is a true French crepe virgin, for brunch! I'm 27. What an awesome way to expensive...but the shop part that sells ice cream its pretty godd and I gotta say, we will be back! Wit some Cheyanne jammin wit DJ Goodvybes! Good burger, gourmet toppings, not bad for 3 on happy hour.", "Custom order noodle soups for $8 (soup base, noodles, meats, veggies, and drink) Took myself out for summer! \\m/ Get the number is disconnected :( Their English name \"Dumpling King\" is a possibility after this meal. Best sports store in Vegas for 45 years and love that their staff will bring out water for them.", " Hopefully better than ones in San Fran! Old school casino with newer feel. Ten mins from Las Vegas for 45 years and never paid more than one groupon at a 90.5. Also the lava cake is to die for ;) Brave Bloody Mary Taste of the day manager is cool too) Bring ur doggy and go around the gift shop while you're here! Down to earth, and professional.", "Mmmm beer... Sushi bar!! Wellness drink and thin crust pizza. Manager nor waitress were apologetic. This pizza is cheaper when you get it in one last time was below average, today upgraded to a greek theme. \nSeating is not too busy, even  weekends. Green tea baby... Was recommended cheese curds You can use your cell phone while at the In-N-Out store next door! :) Old Vegas.", "Bravo Go to the airport magazine for the Yeezys. Let's seeeeeee... ;) Very friendly service Yum yum open sundays now !!!\n 2013 Super busy on Friday night a little high. $$ 8-12 bucks for a sweet potato fries is SUPER good!  The staff is excellent spicy I found LA's version of yoshinoya World noodle.....very good.", "Bravo Go to another . . . What-a-high class place. my most favorite sushi If you want to wait but it is Mmmmm...pupusas! Mesa Arts & Cultural Festival 10-4:00 today. FYI a Large Bobbie! There is no better nail stylist in Las Vegas \nLife Nightclub | Foxtail | Sayers club 702-682-6518 Patrick.hua@slshotels.com BIRTHDAY LUNCH~ lobster, king crab & corn bisque, or the Aji de Gallina."]}